export const POSTS_COUNT = 25;
export const LikeCount = { MIN: 15, MAX: 200 };
export const AVATAR_COUNT = 6;
export const COMMENTS_COUNT = 30;

export const DESCRIPTIONS = [
  'Закат на пляже',
  'Закат в горах',
  'Архитектурное чудо в самом сердце города',
  'Костер на берегу озера',
  'Укромный уголок в парке',
  'Загадочная пустыня',
  'Свадебная церемония',
  'Пейзаж с рекой',
  'Компания на пикнике',
  'Фото кота',
  'Собака играет с мячом',
  'Холмистая местность',
  'Огромный город с небоскребами',
  'Чарующая улыбка',
  'Лунный пейзаж',
  'Новогодний феерверк',
  'Живописная панорама',
  'Пейзаж с водопадом',
  'Вид на морской пейзаж',
  'Портрет мужчины',
  'Портрет женщины',
  'Загадочный лес',
  'Полевые цветы',
  'Черно-белая фотография городских улиц',
  'Зимний сад',
];

export const COMMENTS_MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!',
];

export const NAMES = [
  'Елизавета',
  'Диана',
  'Ксения',
  'Дарья',
  'Екатерина',
  'Дмитрий',
  'Антон',
  'Никита',
  'Кирилл',
  'Илья'
];
